Repository: openSUSE/cryptconfig
Catalog: po/*.po
Languages: pl

source: Don't verify the passphrase
pl: Nie weryfikuj hasła

source: Don't setup pam_mount
pl: Nie konfiguruj pam_mount

source: Don't copy user's existing data
pl: Nie kopiuj istniejących danych użytkownika

source: Use random data to fill the image
pl: Używaj danych losowych do wypełnienia obrazu

source: Overwrite existing image and key
pl: Nadpisuj istniejący obraz i klucz

source: Remove the old home directory after data is copied
pl: Usuń stary katalog domowy po skopiowaniu danych

source: Replace an existing user entry in pam_mount
pl: Zamień wpis dotyczący istniejącego użytkownika w pam_mount

source: The filesystem type. The default is ext3
pl: Typ systemu plików. Domyślnym jest ext3.

source: The home directory image. The default is $USER_HOME.img
pl: Obraz katalogu domowego. Domyślny to $USER_HOME.img

source: The image key file. The default is $USER_HOME.key
pl: Pliku klucza obrazu. Domyślny to $USER_HOME.key

source: Use an existing key file instead of generating a new one
pl: Używaj istniejącego klucza zamiast generować nowy

source: Add an additional key file to the image
pl: Dodaj dodatkowy plik klucza do obrazu

source: Using an encrypted home directory for root is not supported
pl: Szyfrowany katalog domowy użytkownika root nie jest obsługiwany

source: %s is not a supported file system Supported file systems are: %s
pl: System plików %s nie jest obsługiwany. Dostępne systemy plików to: %s

source: Invalid image size
pl: Nieprawidłowy rozmiar obrazu

source: The image_size must be at least %lld MBs for the chosen file system.
pl: Wartość image_size dla wybranego systemu plików musi wynosić co najmniej %lld MB.

source: Failed to lookup user '%s'
pl: Wyszukiwanie użytkownika "%s" nie powiodło się

source: pam_mount is already setup for %s. Use --replace to replace the existing entry
pl: pam_mount jest ustawione dla %s. Opcja --replace zamienia istniejący wpis.

source: Failed to remove old pam_mount entry
pl: Usunięcie starego wpisu pam_entry nie powiodło się

source: image file must be an absolute path
pl: plik obrazu musi być podany z pełną ścieżką

source: '%s' is not a directory
pl: "%s" nie jest katalogiem

source: Not enough space to create %s
pl: Niewystarczająca ilość miejsca do utworzenia %s

source: %s already exists. Use --force to overwrite it.
pl: %s już istnieje. Opcja --force pozwala na nadpisanie.

source: You can't specify both --key-file and --existing-key-file
pl: Nie można używać jednocześnie --key-file i --existing-key-file

source: The existing key file must be an absolute path
pl: Plik istniejącego klucza musi być podany z pełną ścieżką

source: %s does not exist
pl: %s nie istnieje

source: The key file must be an absolute path
pl: Plik klucza musi być podany z pełną ścieżką

source: The key file directory does not exist
pl: Katalog pliku klucza nie istnieje

source: '%s' already exists. Use --force to overwrite it.
pl: "%s" już istnieje. Opcja --force pozwala na nadpisanie.

source: Skipping data copy since user's home directory does not exist
pl: Pominięto kopiowanie danych, ponieważ katalog użytkownika nie istnieje.

source: There is not enough disk space left to copy existing data
pl: Brak miejsca na dysku do skopiowania wszystkich danych

source: The specified image size is not large enough to hold the user's data
pl: Podany rozmiar obrazu jest zbyt mały, aby pomieścić dane użytkownika

source: Enter the password for %s
pl: Proszę podać hasło dla %s

source: Enter %s's password
pl: Proszę podać hasło użytkownika %s

source: Failed to get password
pl: Pobranie hasła nie powiodło się

source: Unable to decrypt %s with the supplied password
pl: Nie można odszyfrować %s za pomocą podanego hasła

source: Failed to get key data
pl: Pobranie danych klucza nie powiodło się

source: Failed to create image key
pl: Tworzenie klucza obrazu nie powiodło się

source: Failed to set permissions for key file
pl: Ustawienie uprawnień dla pliku klucza nie powiodło się

source: Creating disk image...
pl: Tworzenie obrazu dysku...

source: Failed to create image
pl: Tworzenie obrazu nie powiodło się

source: Done
pl: Zakończono

source: Failed to set permissions for new image
pl: Ustawienie uprawnień dla nowego obrazu nie powiodło się

source: Failed to open image
pl: Otwarcie obrazu nie powiodło się

source: Failed to format image
pl: Formatowanie obrazu nie powiodło się

source: Failed to add extra key
pl: Dodanie klucza nie powiodło się

source: Failed to create filesystem.
pl: Tworzenie systemu plików nie powiodło się

source: Failed to mount image
pl: Montowanie obrazu nie powiodło się

source: Failed to set new directory permissions
pl: Ustawienie uprawnień katalogu nie powiodło się

source: Copying existing data from %s. This may take some time...
pl: Kopiowanie danych z %s. Proces ten może chwilę potrwać...

source: Failed to copy user data
pl: Kopiowanie plików użytkownika nie powiodło się

source: Done.
pl: Zakończono.

source: Failed to setup pam_mount
pl: Konfiguracja pam_mount nie powiodła się

source: Don't verify the new password
pl: Nie weryfikuj nowego hasła

source: The filesystem type, defaults to ext3
pl: Typ systemu plików; domyślnym jest ext3

source: parsing failed: %s
pl: błąd przetwarzania: %s

source: %s is not a block device
pl: %s nie jest urządzeniem blokowym

source: %s is currently mounted
pl: %s jest aktualnie zamontowany

source: Enter a password for the partition
pl: Proszę podać hasło dla partycji

source: Formatting device...
pl: Formatowanie urządzenia...

source: Failed to format %s
pl: Formatowanie %s nie powiodło się

source: Failed to open %s
pl: Otwarcie %s nie powiodło się

source: Creating file system on device...
pl: Tworzenie systemu plików na urządzeniu...

source: Failed to create filesystem.
pl: Tworzenie systemu plików nie powiodło się

source: Overwrite an existing image
pl: Nadpisz istniejący obraz

source: The image key file
pl: Plik klucza obrazu

source: The file system type, defaults to ext3
pl: Typ systemu plików; domyślnym jest ext3

source: %s already exists. Use --force to overwrite.
pl: "%s" już istnieje. Opcja --force pozwala na nadpisanie.

source: Enter the password for the existing key file
pl: Proszę podać hasło dla istniejącego pliku klucza

source: Enter a password to encrypt the key file with
pl: Proszę podać hasło, którym zostanie zaszyfrowany plik klucza

source: Enter the new image password
pl: Proszę podać nowe hasło obrazu

source: Failed to read key data
pl: Odczytanie danych klucza nie powiodło się

source: Creating LUKS header...
pl: Tworzenie nagłówka LUKS...

source: Failed to format device
pl: Formatowanie urządzenia nie powiodło się

source: Failed to create map name
pl: Tworzenie nazwy mapy nie powiodło się

source: Failed to open device
pl: Otwarcie urządzenia nie powiodło się

source: Failed create file system on mapped device
pl: Utworzenie systemu plików na zmapowanym urządzeniu nie powiodło się

source: The encrytped key for the image
pl: Zaszyfrowany klucz obrazu

source: Invalid size
pl: Nieprawidłowy rozmiar

source: Image file '%s' does not exist
pl: Plik obrazu "%s" nie istnieje

source: Failed to resize image
pl: Zmiana rozmiaru obrazu nie powiodła się

source: Failed to unlock image
pl: Odblokowanie obrazu nie powiodło się

source: Failed to resize the file system on %s
pl: Zmiana rozmiaru systemu plików na %s nie powiodła się

source: Failed to stat '%s': %s
pl: Wykonanie polecenia stat dla "%s" nie powiodło się: %s

source: Enter the EXISTING password
pl: Proszę podać AKTUALNE hasło

source: Failed to get existing password
pl: Pobranie aktualnego hasła nie powiodło się

source: Enter the NEW password
pl: Proszę podać NOWE hasło

source: Failed to get new password
pl: Pobranie nowego hasła nie powiodło się

source: Failed to decrypt key with old password.
pl: Odszyfrowanie klucza za pomocą poprzedniego hasła nie powiodło się.

source: Failed to encrypt new key
pl: Szyfrowanie nowego klucza nie powiodło się

source: Failed to retain permissions for %s
pl: Zapisanie uprawnień dla %s nie powiodło się

source: The user's home image file, defaults to /home/$USER.img
pl: Plik obrazu katalogu domowego; domyślnym jest /home/$USER.img

source: The user's image key file, defaults to /home/$USER.key
pl: Plik klucza obrazu użytkownika; domyślnym jest /home/$USER.key

source: Failed to lookup user %s
pl: Wyszukiwanie użytkownika %s nie powiodło się

source: The image file must be an absolute path
pl: Plik obrazu musi być podany z pełną ścieżką

source: The image file '%s' does not exist
pl: Plik obrazu "%s" nie istnieje.

source: The key file '%s' does not exist
pl: Plik klucza "%s" nie istnieje

source: Failed to enable pam_mount
pl: Włączenie pam_mount nie powiodło się

source: pam_mount is now enabled for %s
pl: Włączono pam_mount dla %s

source: Disable pam_mount for all users
pl: Wyłącz pam_mount dla wszystkich użytkowników

source: Failed to disable pam_mount
pl: Wyłączenie pam_mount nie powiodło się

source: pam_mount is disabled for all users
pl: pam_mount jest wyłączony dla wszystkich użytkowników

source: pam_mount is disabled for %s
pl: pam_mount jest wyłączony dla %s

source: Overwrite an existing key
pl: Nadpisz istniejący klucz

source: The key file already exists. Use --force to overwrite it.
pl: Plik klucza już istnieje. Opcja --force pozwala na nadpisanie.

source: Failed to generate key data
pl: Generowanie danych klucza nie powiodło się

source: Enter a password for the new key
pl: Proszę podać hasło dla nowego klucza

source: Mount the image at the specified directory
pl: Zamontuj obraz w podanym katalogu

source: %s is not a directory
pl: %s nie jest katalogiem

source: Failed to mount device
pl: Montowanie urządzenia nie powiodło się

source: %s is now mounted at %s
pl: %s jest aktualnie zamontowane w %s

source: %s is now available as device %s
pl: %s jest dostępne jako urządzenie %s

source: Unable to find device
pl: Nie można znaleźć urządzenia

source: Failed to umount: %s
pl: Odmontowanie nie powiodło się: %s

source: Unable to close mapped device
pl: Nie można zamknąć mapowanego urządzenia

source: Unable to close loop device
pl: Nie można zamknąć urządzenia pętli

source: The filesystem type. The default is ext3.
pl: Typ systemu plików. Domyślnym jest ext3.

source: Pam mount is not setup for '%s'
pl: Pam mount nie jest konfiguracją dla "%s"

source: %s is currently in use. Unable to continue.
pl: %s jest aktualnie używany. Nie można kontynuować.

source: Failed to add %s
pl: Dodanie %s nie powiodło się

source: Failed to remove %s
pl: Usunięcie %s nie powiodło się

source: usage: %s [COMMAND] [COMMAND-OPTIONS] arg1 arg2... COMMANDS
pl: użycie: %s [POLECENIE] [OPCJE-POLECENIA] arg1 arg2... POLECENIA

source: You can run %s [COMMAND] --help for more information on a command.
pl: %s [POLECENIE] --help wyświetla więcej informacji o poleceniu.

source: Create an encrypted home directory image and image key
pl: Utwórz obraz zaszyfrowanego katalogu domowego i klucza

source: Enlarge a disk image and it's file system
pl: Powiększ obraz dysku i jego system plików

source: Change the password used to encrypt/decrypt a key file
pl: Zmień hasło do szyfrowania pliku klucza

source: Enable pam_mount with encrypted home directories
pl: Włącz pam_mount z zaszyfrowanymi katalogami domowymi

source: Disable pam_mount with encrypted home directories
pl: Wyłącz pam_mount z zaszyfrowanymi katalogami domowymi

source: Create an arbitrary LUKS image
pl: Utwórz dowolny obraz dysku LUKS

source: Create a LUKS partition on a device
pl: Utwórz partycję LUKS na urządzeniu

source: Create a new key that can be added to a LUKS image
pl: Utwórz nowy klucz, który można dodać do obrazu LUKS

source: Open a LUKS image
pl: Otwórz obraz LUKS

source: Close devices using a LUKS image
pl: Zamknij urządzenia korzystające z obrazu LUKS

source: Add public data
pl: Dodaj dane publiczne

source: Remove public data
pl: Usuń dane publiczne

source: You must be root to run this command
pl: Do wykonania tego polecenia wymagane są uprawnienia administratora

source: move failed: %s
pl: przenoszenie nie powiodło się: %s

source: Failed to load
pl: Nie powiodło się wczytanie

source: Failed to load service list from
pl: Nie powiodło się wczytanie listy usług z

source: Failed to get pam services list
pl: Pobranie listy usług pam nie powiodło się

source: key file is too large
pl: plik klucza jest zbyt duży

source: Failed to create temp file
pl: Tworzenie pliku tymczasowego nie powiodło się

source: copy failed: %s
pl: kopiowanie nie powiodło się: %s

source: The map device for this image is in use
pl: Urządzenie mapujące dla tego obrazu jest używane

source: Enter the key file password
pl: Proszę podać hasło pliku klucza

source: Enter the image password
pl: Proszę podać hasło obrazu

source: Unable to access the specified key file
pl: Brak dostępu do podanego pliku klucza

source: Failed to decrypt key file with the provided password
pl: Odszyfrowanie pliku klucza za pomocą podanego hasła nie powiodło się

source: Failed to open disk image
pl: Otwarcie obrazu dysku nie powiodło się

source: Extra key file does not exist
pl: Plik dodatkowego klucza nie istnieje

source: Enter the password for the extra key
pl: Proszę podać hasło dla dodatkowego klucza

source: Failed to get extra key password
pl: Pobranie hasła dodatkowego klucza nie powiodło się

source: Failed to decrypt extra key
pl: Odszyfrowanie dodatkowego klucza nie powiodło się

source: Enter key file password
pl: Proszę podać hasło pliku klucza
